turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cm/atdf/ATSAM4CMP8C_1.atdf
        <register caption="Interrupt Status Register" name="IPC_ISR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Current Interrupt Identifier" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x80000000" name="IRQ31"/>
        </register>
      </register-group>
    </module>
    <module caption="AHB Bus Matrix" name="MATRIX" version="11206B">
      <register-group name="MATRIX">
        <register caption="Master Configuration Register 0" name="MATRIX_MCFG0" offset="0x0" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 1" name="MATRIX_MCFG1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 2" name="MATRIX_MCFG2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 3" name="MATRIX_MCFG3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 4" name="MATRIX_MCFG4" offset="0x10" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 5" name="MATRIX_MCFG5" offset="0x14" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 6" name="MATRIX_MCFG6" offset="0x18" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Slave Configuration Register 0" name="MATRIX_SCFG0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 1" name="MATRIX_SCFG1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 2" name="MATRIX_SCFG2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 3" name="MATRIX_SCFG3" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 4" name="MATRIX_SCFG4" offset="0x50" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 5" name="MATRIX_SCFG5" offset="0x54" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 6" name="MATRIX_SCFG6" offset="0x58" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 7" name="MATRIX_SCFG7" offset="0x5C" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
