turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cm/atdf/ATSAM4CMP8C_1.atdf
                <register offset="0x00000104" size="4" name="NVICISPR1" initval="0" caption="Interrupt Set Pending Register n">
                    <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
                </register>
                <register offset="0x00000108" size="4" name="NVICISPR2" initval="0" caption="Interrupt Set Pending Register n">
                    <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
                </register>
                <register offset="0x0000010c" size="4" name="NVICISPR3" initval="0" caption="Interrupt Set Pending Register n">
                    <bitfield mask="0xffffffff" name="SETPEND" caption="Interrupt set-pending bits"/>
                </register>
                <register offset="0x00000180" size="4" name="NVICICPR0" initval="0" caption="Interrupt Clear Pending Register n">
                    <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
                </register>
                <register offset="0x00000184" size="4" name="NVICICPR1" initval="0" caption="Interrupt Clear Pending Register n">
                    <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
                </register>
                <register offset="0x00000188" size="4" name="NVICICPR2" initval="0" caption="Interrupt Clear Pending Register n">
                    <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
                </register>
                <register offset="0x0000018c" size="4" name="NVICICPR3" initval="0" caption="Interrupt Clear Pending Register n">
                    <bitfield mask="0xffffffff" name="CLRPEND" caption="Interrupt clear-pending bits"/>
                </register>
                <register offset="0x00000200" size="4" name="NVICIABR0" initval="0" caption="Interrupt Active bit Register n">
                    <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
                </register>
                <register offset="0x00000204" size="4" name="NVICIABR1" initval="0" caption="Interrupt Active bit Register n">
                    <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
                </register>
                <register offset="0x00000208" size="4" name="NVICIABR2" initval="0" caption="Interrupt Active bit Register n">
                    <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
                </register>
                <register offset="0x0000020c" size="4" name="NVICIABR3" initval="0" caption="Interrupt Active bit Register n">
                    <bitfield mask="0xffffffff" name="ACTIVE" caption="Interrupt active flags"/>
                </register>
                <register offset="0x00000300" size="1" name="NVICIP0" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI0" caption="Priority of interrupt 0"/>
                </register>
                <register offset="0x00000301" size="1" name="NVICIP1" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI1" caption="Priority of interrupt 1"/>
                </register>
                <register offset="0x00000302" size="1" name="NVICIP2" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI2" caption="Priority of interrupt 2"/>
                </register>
                <register offset="0x00000303" size="1" name="NVICIP3" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI3" caption="Priority of interrupt 3"/>
                </register>
                <register offset="0x00000304" size="1" name="NVICIP4" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI4" caption="Priority of interrupt 4"/>
                </register>
                <register offset="0x00000305" size="1" name="NVICIP5" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI5" caption="Priority of interrupt 5"/>
                </register>
                <register offset="0x00000306" size="1" name="NVICIP6" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI6" caption="Priority of interrupt 6"/>
                </register>
                <register offset="0x00000307" size="1" name="NVICIP7" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI7" caption="Priority of interrupt 7"/>
                </register>
                <register offset="0x00000308" size="1" name="NVICIP8" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI8" caption="Priority of interrupt 8"/>
                </register>
                <register offset="0x00000309" size="1" name="NVICIP9" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI9" caption="Priority of interrupt 9"/>
                </register>
                <register offset="0x0000030a" size="1" name="NVICIP10" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI10" caption="Priority of interrupt 10"/>
                </register>
                <register offset="0x0000030b" size="1" name="NVICIP11" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI11" caption="Priority of interrupt 11"/>
                </register>
                <register offset="0x0000030c" size="1" name="NVICIP12" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI12" caption="Priority of interrupt 12"/>
                </register>
                <register offset="0x0000030d" size="1" name="NVICIP13" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI13" caption="Priority of interrupt 13"/>
                </register>
                <register offset="0x0000030e" size="1" name="NVICIP14" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI14" caption="Priority of interrupt 14"/>
                </register>
